[{"ticker": "NFLX", "title": "Is Netflix Stock a Buy Now?", "link": "https://www.nasdaq.com/articles/is-netflix-stock-a-buy-now", "snippet": "Netflix's (NASDAQ: NFLX) stock price has only risen about 6% over the past 12 months as the S&P 500 advanced 26%. Those tepid returns made the streaming video giant the second-weakest member of the FAANG cohort,"}, {"ticker": "NFLX", "title": "The 10 Best New Movies Added To Netflix In January", "link": "https://www.forbes.com/sites/travisbean/2022/01/08/the-10-best-new-movies-added-to-netflix-in-january/", "snippet": "I scoured through every new movie that's new to Netflix so far this month and picked out ten of my favorites. In this article I'll go through each one of them—and at the end, you can find include a full list of all the new movies and TV shows that are available on Netflix this month."}, {"ticker": "NFLX", "title": "Tech Roundup: Apple claims a new title and more picks for the year ahead", "link": "https://seekingalpha.com/news/3786340-tech-roundup-apple-claims-a-new-title-and-more-picks-for-the-year-ahead", "snippet": "The first week of 2022 was loaded with more prognostications from Wall Street analysts making their picks for the top stocks in various areas of the tech sector."}, {"ticker": "NFLX", "title": "M&r Capital Management Inc Buys Meta Platforms Inc, Coca-Cola Co, Linde PLC, Sells ...", "link": "https://finance.yahoo.com/news/m-r-capital-management-inc-023802452.html", "snippet": "New York, NY, based Investment company M&r Capital Management Inc (Current Portfolio) buys Meta Platforms Inc, Coca-Cola Co, Linde PLC, Eaton Corp PLC, Morgan Stanley, sells PagSeguro Digital, Snap Inc,"}, {"ticker": "NFLX", "title": "Nearly 8% of the S&P 500 has taken a bath this week — 39 stocks fell at least 10%", "link": "https://www.morningstar.com/news/marketwatch/20220108320/nearly-8-of-the-sp-500-has-taken-a-bath-this-week-39-stocks-fell-at-least-10", "snippet": "But there are others whose shareholders are feeling the pain; 39 components of the S&P 500 have fallen 10% for a range of reasons. For example, homebuilder D.R. Horton Inc. (DHI) was down 6.2% on Jan."}, {"ticker": "NFLX", "title": "These Were The Ten Worst Performing Mega Cap Stocks In December 2021", "link": "https://www.entrepreneur.com/article/412065", "snippet": "December 2021 was a good month for the stock market overall, with the Dow marking its fifth straight monthly gain and the Nasdaq recording a six-month winning streak. However,"}, {"ticker": "NFLX", "title": "A Scott Pilgrim anime show is coming to Netflix", "link": "https://www.msn.com/en-us/news/technology/a-scott-pilgrim-anime-show-is-coming-to-netflix/ar-AASzN1m", "snippet": "Scott Pilgrim is making yet another comeback, this time as an anime show on Netflix. As reported by Hollywood Reporter, anime house Science SARU has signed on do the animation work for a show that will be written and exec produced by Scott Pilgrim's artist/creator,"}, {"ticker": "NFLX", "title": "Streaming in Canada on Amazon Prime Video, Apple TV+, Crave, Netflix and PVOD [Jan. 3-9]", "link": "https://mobilesyrup.com/2022/01/08/streaming-in-canada-amazon-prime-video-apple-tv-plus-crave-netflix-pvod-euphoria-season-2/", "snippet": "The second seasons of Euphoria and The Righteous Gemstones hit Crave, while Amazon is now streaming the Ben Affleck drama The Tender Bar."}, {"ticker": "NFLX", "title": "3 Lessons Every Leader Should Learn From the Netflix Blockbuster 'Don't Look Up'", "link": "https://www.msn.com/en-us/finance/smallbusiness/3-lessons-every-leader-should-learn-from-the-netflix-blockbuster-dont-look-up/ar-AASytDY", "snippet": "The Netflix black comedy Don't Look Up broke weekly records last week when it was viewed for a total of 152.6 hours, the company has announced. The film tells the story of two scientists who spot a \"planet killer\" comet headed toward Earth,"}, {"ticker": "NFLX", "title": "Here Are The 15 Best Reviewed Netflix Shows Of 2021", "link": "https://www.forbes.com/sites/paultassi/2022/01/08/here-are-the-15-best-reviewed-netflix-shows-of-2021/", "snippet": "These are Netflix's ten best shows in 2021, in terms of their original offerings, as sorted by critics' scores."}, {"ticker": "NFLX", "title": "How Kristen Stewart Feels About The Twilight Saga Reaching A New Generation Of Fans Through Netflix", "link": "https://www.msn.com/en-gb/entertainment/movies/how-kristen-stewart-feels-about-the-twilight-saga-reaching-a-new-generation-of-fans-through-netflix/ar-AASzN0m", "snippet": "During a recent interview, she was asked about how she felt about the newfound Twilight craze taking place. Her response: I saw that it's on Netflix, and I was like, 'Oh, it's on Netflix,' like it was on there while I was looking through."}, {"ticker": "NFLX", "title": "A 'Scott Pilgrim' anime series is coming to Netflix", "link": "https://www.msn.com/en-us/news/technology/a-scott-pilgrim-anime-series-is-coming-to-netflix/ar-AASzuxT", "snippet": "Netflix is developing a 'Scott Pilgrim' anime series, and both Bryan Lee O'Malley and Edgar Wright are involved.."}, {"ticker": "NFLX", "title": "This Top New Netflix Show Is Like 'Glee' Meets 'Élite'", "link": "https://ca.news.yahoo.com/top-netflix-show-glee-meets-160400042.html", "snippet": "Netflix just dropped a new Spanish-language drama that seems to have caught the eyes of many viewers, as it's reached the site's list of top shows in only a matter of days. The series, titled Rebelde,"}, {"ticker": "NFLX", "title": "'Scott Pilgrim' Levels Up in New Anime Series Adaptation for Netflix", "link": "https://www.themarysue.com/scott-pilgrim-anime-series/", "snippet": "Scott Pilgrim, which has been a beloved comic, a cult classic film, and an absolutely addictive video game, has now reached boss level with an upcoming anime adaptation. Netflix and and UCP ( The Umbrella Academy,"}, {"ticker": "NFLX", "title": "'Scott Pilgrim': Netflix & UCP Developing Anime Series Based On Graphic Novel, Creator Bryan Lee O'Malley & BenDavid Grabinski To Write", "link": "https://deadline.com/2022/01/scott-pilgrim-anime-series-ucp-netflix-bryan-lee-omalley-ben-david-grabinski-1234906581/", "snippet": "Scott Pilgrim will make his return to screen with Netflix and UCP teaming up for an anime series based on Bryan Lee O'Malley's graphic novel series. Sources confirmed to Deadline that"}, {"ticker": "NFLX", "title": "Rock On! The 'Scott Pilgrim' Comics Are Getting an Anime Adaptation on Netflix", "link": "https://www.cheatsheet.com/entertainment/scott-pilgrim-comics-anime-adaptation-netflix.html/", "snippet": "Scott Pilgrim' fans will soon be able to return to the world of Bryan Lee O'Malley's comics in an anime adaptation that's coming to Netflix."}, {"ticker": "NFLX", "title": "Wes Anderson Will Direct Roald Dahl's Henry Sugar for Netflix", "link": "https://www.superherohype.com/movies/509824-wes-anderson-will-direct-roald-dahls-henry-sugar-for-netflix", "snippet": "Wes Anderson will direct The Wonderful Story of Henry Sugar, based on a short story and collection of same by the author."}, {"ticker": "NFLX", "title": "Sunday Classics: 'Crooked House' on Netflix", "link": "https://www.telegraphindia.com/my-kolkata/try-this/watch/sunday-classics-crooked-house-on-netflix/cid/1846733", "snippet": "It's the perfect Sunday for an Agatha Christie country house murder mystery, so make yourself a cuppa joe because the cinematic adaptation of Christie's novel Crooked House just dropped on Netflix. The 2017 mystery film by Gilles Paquet-Brenner follows the extremely wealthy but dysfunctional Leonides family following the death of their patriarch,"}, {"ticker": "NFLX", "title": "New Netflix Drama Starring Olivia Coleman Has 96 Percent Score On Rotten Tomatoes", "link": "https://www.ladbible.com/entertainment/new-netflix-drama-has-96-score-on-rotten-tomatoes-20220108", "snippet": "The movie has received praise across the board from the critics, in turn leading to a 96 percent rating on Rotten Tomatoes"}, {"ticker": "NFLX", "title": "The Netflix original movie 'Looop Lapeta' starring Taapsee Pannu and Tahir Raj Bhasin will be released on February 4", "link": "https://www.msn.com/en-in/news/other/the-netflix-original-movie-looop-lapeta-starring-taapsee-pannu-and-tahir-raj-bhasin-will-be-released-on-february-4/ar-AASzq4N", "snippet": "Taapsee Pannu's film Looop Lapeta will be released on Netflix, so her fans are sure to start the year on a high note. In an Instagram post on Saturday, Taapsee announced that 'Looop Lapeta', which also stars Tahir Raj Bhasin,"}, {"ticker": "NFLX", "title": "Netflix will air an anime series based on Scott Pilgrim", "link": "https://www.msn.com/en-in/news/other/netflix-will-air-an-anime-series-based-on-scott-pilgrim/ar-AASz7WO", "snippet": "Michael Cera starred as Scott Pilgrim and Mary Elizabeth Winstead as Ramona in the film version titled 'Scott Pilgrim vs. The World'."}, {"ticker": "NFLX", "title": "Wes Anderson Confirmed To Direct Netflix's Roald Dahl Adaptation Starring Benedict Cumberbatch", "link": "https://www.yahoo.com/lifestyle/wes-anderson-confirmed-direct-netflixs-052009231.html", "snippet": "Wes Anderson has been confirmed to direct Netflix's latest Roald Dahl feature adaptation, The Wonderful Story of Henry Sugar. Since the streaming giant acquired the Roald Dahl Story Company last September,"}, {"ticker": "NFLX", "title": "SCOTT PILGRIM Netflix Animated Series In The Works With Creator Bryan Lee O'Malley On Board", "link": "https://comicbookmovie.com/scott_pilgrim_vs_the_world/scott-pilgrim-netflix-animated-series-in-the-works-with-creator-bryan-lee-omalley-on-board-a190856", "snippet": "Netflix and UCP (The Umbrella Academy, Chucky) are developing a new anime series based on acclaimed comic book Scott Pilgrim, with creator/artist Bryan Lee O'Malley on board as executive producer."}, {"ticker": "NFLX", "title": "Squid Game's Gong Yoo reacts to mixed fan response for Netflix's The Silent Sea", "link": "https://www.digitalspy.com/tv/a38701702/squid-game-gong-yoo-silent-sea-netflix-mixed-fan-response/", "snippet": "Squid Game star Gong Yoo has a thought-provoking response for fans' mixed reaction to Netflix's sci-fi, The Silent Sea. The thriller series, in which the star plays Han Yoon-jae, is based on a short film directed by Choi Hang-yong,"}, {"ticker": "NFLX", "title": "After Life's Ricky Gervais explains why he won't make season 4 of Netflix show", "link": "https://www.digitalspy.com/tv/a38700740/ricky-gervais-after-life-no-season-4/", "snippet": "Ricky Gervais is known for ending his shows after two series and a special, but Netflix's After Life is coming back for its third season in less than a week. Although he's broken his tradition, the comedian has insisted that this is the final season of the show,"}, {"ticker": "NFLX", "title": "Hype House members: Meet the TikTok famous cast of the new Netflix show", "link": "https://metro.co.uk/2022/01/08/hype-house-members-meet-the-tiktok-famous-cast-of-new-netflix-show-15887164/", "snippet": "TikTok has boomed as one of the most dominant forms of social media, with several young stars gaining fame after attracting droves of followers. A new Netflix show called The Hype House shines a light on the members of the collective of the same name,"}, {"ticker": "NFLX", "title": "Taapsee Pannu, Tahir Raj Bhasin's 'Looop Lapeta' to release on Netflix on February 4", "link": "https://news.webindia123.com/news/Articles/Entertainment/20220108/3888705.html", "snippet": "February 2022 will surely start on a great note for actor Taapsee Pannu's fans as her film 'Looop Lapeta' is scheduled to hit Netflix next month. On Saturday, Taapsee took to Instagram and informed fans that 'Looop Lapeta',"}, {"ticker": "NFLX", "title": "Hype House: Nikita Dragun apologises over blackfishing claims as Larray raises concerns in Netflix TikTok series", "link": "https://metro.co.uk/2022/01/08/hype-house-nikita-dragun-apologises-over-blackfishing-claims-15887590/?ico=related-posts", "snippet": "Nikita Dragun, one of the stars of The Hype House, has apologised over blackfishing claims during a heartfelt conversation with her close friend Larray in an episode of the Netflix series. The new TV show follows a social media collective called The Hype House,"}, {"ticker": "NFLX", "title": "'Scott Pilgrim' getting anime series at Netflix", "link": "https://news.webindia123.com/news/Articles/Entertainment/20220108/3888871.html", "snippet": "After 'The Terminator', 'Army of the Dead' and more, popular streaming giant Netflix is now developing an anime series on 2010 hit romantic-action film 'Scott Pilgrim'. Variety has confirmed that the show would be produced by UCP."}]